Dataframe dropna()

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'age': [12.0, 13.0, 14.0, 16.0],
    'weight': [41.1, 34.5, 83.2, 90.1],
    'height': [1.72, 1.74, 1.91, 1.54]
})

In [3]:
df

    age  weight  height
0  12.0    41.1    1.72
1  13.0    34.5    1.74
2  14.0    83.2    1.91
3  16.0    90.1    1.54

In [4]:
df.loc[2, 'weight'] = np.nan

In [5]:
df

    age  weight  height
0  12.0    41.1    1.72
1  13.0    34.5    1.74
2  14.0     NaN    1.91
3  16.0    90.1    1.54

In [6]:
df.loc[1, :] = np.nan

In [7]:
df

    age  weight  height
0  12.0    41.1    1.72
1   NaN     NaN     NaN
2  14.0     NaN    1.91
3  16.0    90.1    1.54

In [8]:
df.dropna()

    age  weight  height
0  12.0    41.1    1.72
3  16.0    90.1    1.54

In [9]:
df.dropna(how='any', axis=0)

    age  weight  height
0  12.0    41.1    1.72
3  16.0    90.1    1.54

In [10]:
df.dropna(how='all', axis=0)

    age  weight  height
0  12.0    41.1    1.72
2  14.0     NaN    1.91
3  16.0    90.1    1.54

In [ ]:
# thresh

# it specifically say how many non Na values we want in a given sequence

In [11]:
df.dropna(thresh=3, axis=0) # minimum no of non Na values for the record to be included

    age  weight  height
0  12.0    41.1    1.72
3  16.0    90.1    1.54

In [12]:
df

    age  weight  height
0  12.0    41.1    1.72
1   NaN     NaN     NaN
2  14.0     NaN    1.91
3  16.0    90.1    1.54

In [13]:
df.dropna(thresh=df.shape[1], axis=0)

    age  weight  height
0  12.0    41.1    1.72
3  16.0    90.1    1.54

In [14]:
df.shape

(4, 3)

In [15]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [16]:
df

    age  weight  height
0  12.0    41.1    1.72
1   NaN     NaN     NaN
2  14.0     NaN    1.91
3  16.0    90.1    1.54

In [17]:
df.dropna(axis=1, how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [18]:
df.dropna(axis=1, how='all')

    age  weight  height
0  12.0    41.1    1.72
1   NaN     NaN     NaN
2  14.0     NaN    1.91
3  16.0    90.1    1.54

In [19]:
df.dropna(axis=1, thresh=3)

    age  height
0  12.0    1.72
1   NaN     NaN
2  14.0    1.91
3  16.0    1.54

In [20]:
df

    age  weight  height
0  12.0    41.1    1.72
1   NaN     NaN     NaN
2  14.0     NaN    1.91
3  16.0    90.1    1.54